# Задача №1
# Напишіть функцію, що приймає один аргумент будь-якого типу та повертає цей аргумент,
# перетворений на float. Якщо перетворити не вдається функція має повернути 0.

def to_float(value):
    try:
        value = float(value)
        return value
    except:
        return 0


# Задача №2
# Напишіть функцію, що приймає два аргументи. Функція повинна
# - якщо аргументи відносяться до числових типів (int, float) - повернути перемножене значення цих аргументів,
# - якщо обидва аргументи це строки (str) - обʼєднати в одну строку та повернути
# - у будь-якому іншому випадку повернути кортеж з цих аргументів

def two_point(arg1, arg2):
    if isinstance(arg1, int) and isinstance(arg2, int):
        return int(arg1) * int(arg2)
    elif isinstance(arg1, float) and isinstance(arg2, float):
        return float(arg1) * float(arg2)
    elif isinstance(arg1, str) and isinstance(arg2, str):
        return f'{str(arg1)} {str(arg2)}'
    elif isinstance(arg1, str) and not isinstance(arg2, str):
        return {arg1: arg2}
    else:
        return arg1, arg2

print(two_point('a', 2))


# Задача №3
# Напишіть функцію, що приймає один аргумент будь-якого типу та повертає цей аргумент, перетворений на float. Якщо перетворити не вдається функція має повернути 0.
# Напишіть функцію, що приймає два аргументи. Функція повинна
# якщо аргументи відносяться до числових типів (int, float) - повернути перемножене значення цих аргументів,
# якщо обидва аргументи це строки (str) - обʼєднати в одну строку та повернути
# у будь-якому іншому випадку повернути кортеж з цих аргументів
# Перепишіть за допомогою функцій вашу программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <> <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <> <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <> <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача містить 7 - вивести "Вам <> <>, вам пощастить"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <> <>, білетів всеодно нема!"
# Замість <> <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік. Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...). Наприклад :
# "Тобі ж 5 років! Де твої батьки?"
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
# "Незважаючи на те, що вам 42 роки, білетів всеодно нема!"

def input_age():
    user_age = input('Введіть ваш вік: ')
    return user_age

user_age = input_age()

def last_age_number():
    age1 = 'рік'
    age2 = 'роки'
    age3 = 'років'

    if user_age.endswith('1') and len(user_age) == 1:
        age_end = age1
    elif user_age.endswith('1') and user_age.startswith(('2', '3', '4', '5', '6', '7', '8', '9', '10', '12')):
        age_end = age1
    elif user_age.endswith(('2', '3', '4')) and user_age.startswith(('2', '3', '4', '5', '6', '7', '8', '9', '10')):
        age_end = age2
    elif user_age.endswith(('5', '6', '7', '8', '9', '0', '11', '12', '13', '14', '15', '16', '17', '18', '19')):
        age_end = age3
    else:
        age_end = ''
    return age_end

age_end = last_age_number()

def print_func():
    if user_age.isdigit() and len(user_age) <= 3:
        userageint = int(user_age)
        if '7' in str(userageint) and userageint < 100:
            print(f'Вам {userageint} {age_end}, вам пощастить')
        else:
            if userageint < 7:
                print(f'Тобі ж {userageint} {age_end}! Де твої батьки?')
            elif userageint < 16:
                print(f'Тобі лише {userageint} {age_end}, а це є фільм для дорослих!')
            elif userageint > 100:
                print(f'Вам {userageint} {age_end}? Введіть справжній вік!')
            elif userageint > 65:
                print(f'Вам {userageint} {age_end}? Покажіть пенсійне посвідчення!')
            else:
                print(f'Незважаючи на те, що вам {userageint} {age_end}, білетів все одно нема!')
    else:
        print('Це не вік')

text_value = print_func()




